In [3]:
import numpy as ap
import pandas as pd
import matplotlib.pyplot as plt
import mpl_toolkits
%matplotlib inline

In [4]:
data = pd.read_csv("C:/datasets/kc_house_data.csv")

In [5]:
data.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900,3,1.00,1180,5650,1,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000,3,2.25,2570,7242,2,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000,2,1.00,770,10000,1,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000,4,3.00,1960,5000,1,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000,3,2.00,1680,8080,1,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

In [6]:
del data['id']

In [7]:
del data['date']

In [8]:
del data['sqft_lot']

In [9]:
del data['waterfront']

In [10]:
del data['sqft_above']
del data['sqft_basement']
del data['sqft_living15']

In [11]:
del data['sqft_lot15']

In [12]:
del data['view']

In [13]:
data.head()

,price,bedrooms,bathrooms,sqft_living,floors,condition,grade,yr_built,yr_renovated,zipcode,lat,long
0,221900,3,1.00,1180,1,3,7,1955,0,98178,47.5112,-122.257
1,538000,3,2.25,2570,2,3,7,1951,1991,98125,47.7210,-122.319
2,180000,2,1.00,770,1,3,6,1933,0,98028,47.7379,-122.233
3,604000,4,3.00,1960,1,5,7,1965,0,98136,47.5208,-122.393
4,510000,3,2.00,1680,1,3,8,1987,0,98074,47.6168,-122.045

In [14]:
data.head(10)

,price,bedrooms,bathrooms,sqft_living,floors,condition,grade,yr_built,yr_renovated,zipcode,lat,long
0,221900,3,1.00,1180,1,3,7,1955,0,98178,47.5112,-122.257
1,538000,3,2.25,2570,2,3,7,1951,1991,98125,47.7210,-122.319
2,180000,2,1.00,770,1,3,6,1933,0,98028,47.7379,-122.233
3,604000,4,3.00,1960,1,5,7,1965,0,98136,47.5208,-122.393
4,510000,3,2.00,1680,1,3,8,1987,0,98074,47.6168,-122.045
5,1225000,4,4.50,5420,1,3,11,2001,0,98053,47.6561,-122.005
6,257500,3,2.25,1715,2,3,7,1995,0,98003,47.3097,-122.327
7,291850,3,1.50,1060,1,3,7,1963,0,98198,47.4095,-122.315
8,229500,3,1.00,1780,1,3,7,1960,0,98146,47.5123,-122.337
9,323000,3,2.50,1890,2,3,7,2003,0,98038,47.3684,-122.031

In [15]:
import numpy as np

In [16]:
data1 = pd.DataFrame(data)

In [17]:
data1['bathrooms'] = data1.bathrooms.astype(int)

### Adding dummy columns

In [18]:
data.head(10)

,price,bedrooms,bathrooms,sqft_living,floors,condition,grade,yr_built,yr_renovated,zipcode,lat,long
0,221900,3,1,1180,1,3,7,1955,0,98178,47.5112,-122.257
1,538000,3,2,2570,2,3,7,1951,1991,98125,47.7210,-122.319
2,180000,2,1,770,1,3,6,1933,0,98028,47.7379,-122.233
3,604000,4,3,1960,1,5,7,1965,0,98136,47.5208,-122.393
4,510000,3,2,1680,1,3,8,1987,0,98074,47.6168,-122.045
5,1225000,4,4,5420,1,3,11,2001,0,98053,47.6561,-122.005
6,257500,3,2,1715,2,3,7,1995,0,98003,47.3097,-122.327
7,291850,3,1,1060,1,3,7,1963,0,98198,47.4095,-122.315
8,229500,3,1,1780,1,3,7,1960,0,98146,47.5123,-122.337
9,323000,3,2,1890,2,3,7,2003,0,98038,47.3684,-122.031

In [1]:
import numpy as np
import pandas as pd
desired_price=['250,000','200,000','300,000','400,000']
actual_price=['200,000','300,000','400,000','350,000']
desired_location_lat=['47.5112','47.7346','47.6567','47.1124']
actual_location_lat=['47.5111','47.7346','47.3333','47.764']
desired_location_lon=['-122.333','-122.076','-122.543','-122.456']
actual_location_lon=['-122.334','-122.077','-122.333','-122.543']
desired_rooms=['3','2','4','1']
actual_rooms=['2','3','4','1']
ratings=['1','2','3','4']
for i in range(1,101):
    desired_location_lat.append(np.random.choice(desired_location_lat))
    actual_location_lat.append(np.random.choice(actual_location_lat))
    desired_location_lon.append(np.random.choice(desired_location_lon))
    actual_location_lon.append(np.random.choice(actual_location_lon))
    desired_price.append(np.random.choice(desired_price))
    actual_price.append(np.random.choice(actual_price))
    desired_rooms.append(np.random.choice(desired_rooms))
    actual_rooms.append(np.random.choice(actual_rooms))
    ratings.append(np.random.choice(ratings))
    
df=pd.DataFrame({'Desired latitude':desired_location_lat,'Actual latitude':actual_location_lat,
                 'Desired longitude':desired_location_lon,'Actual longitude':actual_location_lon,
                 'Desired price':desired_price,'Actual price':actual_price,
                 'Desired rooms':desired_rooms,'Actual rooms':actual_rooms,
                 'Ratings':ratings})
df.head()

,Actual latitude,Actual longitude,Actual price,Actual rooms,Desired latitude,Desired longitude,Desired price,Desired rooms,Ratings
0,47.5111,-122.334,"200,000",2,47.5112,-122.333,"250,000",3,1
1,47.7346,-122.077,"300,000",3,47.7346,-122.076,"200,000",2,2
2,47.3333,-122.333,"400,000",4,47.6567,-122.543,"300,000",4,3
3,47.764,-122.543,"350,000",1,47.1124,-122.456,"400,000",1,4
4,47.3333,-122.333,"400,000",3,47.1124,-122.076,"200,000",4,3

In [ ]:
df_total=df

In [ ]:
data.head(2)

In [19]:
import csv
import numpy as ap
import pandas as pd

#data = pd.read_csv("C:/datasets/kc_house_data.csv")

bedroomMin = input("Please enter max number of bedrooms: ")
bedroomMax = input("Please enter min number of bedrooms: ")
floorsMin = input("Please enter min number of floors: ")
floorsMax = input("Please enter max number of floors: ")
yearBuiltMin = input("Please enter min year for house built: ")
yearBuiltMax = input("Please enter max year for house built: ")
priceMin = input("Please enter min price of house: ")
priceMax = input("Please enter max price of house: ")

#price = input("Please enter your desired price: ")
#bedrooms = input("Please enter your desired bedrooms: ")
#yearBuilt = input("Please enter your desired year built: ")

#def desiredInputs(price, bedrooms, yearBuilt):
    #if(price - price == 0 and bedrooms - bedrooms == 0 and yearBuilt - yearBuilt == 0):
        #desiredResults = 100
        #print('found')

with open("C:/datasets/kc_house_data.csv") as csvfile:
    reader = csv.DictReader(csvfile)
    for row in reader:
        if(row['bedrooms'] >= bedroomMin and row['bedrooms'] <= bedroomMax and row['floors'] >= floorsMin 
           and row['floors'] <= floorsMax and row['yr_built'] >= yearBuiltMin and row['yr_built'] <= yearBuiltMax
           and row['price'] >= priceMin and row['price'] <= priceMax):
            print (row['price'], row['bedrooms'], row['floors'], row['yr_built'])
            #print row[1]
            #print ("we have a match".join(row))
            #print (" ".join(row))
            #print ("House price %d, number of bedrooms %d, number of floors %d, Year %d.") % (price, bedrooms, floors, yr_built)
            
        #else:
            #print ("We could not find a house")

Please enter max number of bedrooms: 3
Please enter min number of bedrooms: 3
Please enter min number of floors: 2
Please enter max number of floors: 2
Please enter min year for house built: 1950
Please enter max year for house built: 1965
Please enter min price of house: 300000
Please enter max price of house: 350000
350000 3 2 1950
340000 3 2 1950

In [1]:
import csv
import numpy as ap
import pandas as pd

d = pd.read_csv("C:/datasets/kc_house_data.csv")

In [11]:
d.head()

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,20141013T000000,221900,3,1.00,1180,5650,1,0,0,3,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,20141209T000000,538000,3,2.25,2570,7242,2,0,0,3,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,20150225T000000,180000,2,1.00,770,10000,1,0,0,3,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,20141209T000000,604000,4,3.00,1960,5000,1,0,0,5,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,20150218T000000,510000,3,2.00,1680,8080,1,0,0,3,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

### Deleting columns

In [12]:
del d['date']

In [13]:
del d['sqft_living']

In [14]:
del d['sqft_lot']

In [15]:
del d['waterfront']

In [16]:
del d['view']

In [17]:
del d['condition']

In [18]:
del d['grade']

In [19]:
d.head()

,price,bedrooms,bathrooms,floors,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,221900,3,1.00,1,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,538000,3,2.25,2,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,180000,2,1.00,1,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,604000,4,3.00,1,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,510000,3,2.00,1,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

In [20]:
del d['sqft_above']

In [21]:
del d['sqft_basement']

In [22]:
del d['yr_built']

In [23]:
del d['yr_renovated']

In [24]:
d.head()

,price,bedrooms,bathrooms,floors,zipcode,lat,long,sqft_living15,sqft_lot15
0,221900,3,1.00,1,98178,47.5112,-122.257,1340,5650
1,538000,3,2.25,2,98125,47.7210,-122.319,1690,7639
2,180000,2,1.00,1,98028,47.7379,-122.233,2720,8062
3,604000,4,3.00,1,98136,47.5208,-122.393,1360,5000
4,510000,3,2.00,1,98074,47.6168,-122.045,1800,7503

In [25]:
del d['sqft_living15']

In [26]:
del d['sqft_lot15']

In [27]:
d.head()

    price  bedrooms  bathrooms  floors  zipcode      lat     long
0  221900         3       1.00       1    98178  47.5112 -122.257
1  538000         3       2.25       2    98125  47.7210 -122.319
2  180000         2       1.00       1    98028  47.7379 -122.233
3  604000         4       3.00       1    98136  47.5208 -122.393
4  510000         3       2.00       1    98074  47.6168 -122.045

In [28]:
del d['lat']

In [29]:
del d['long']

In [36]:
d.head()

    price  bedrooms  bathrooms  floors
0  221900         3       1.00       1
1  538000         3       2.25       2
2  180000         2       1.00       1
3  604000         4       3.00       1
4  510000         3       2.00       1

In [38]:
d['bathrooms'] = d.bathrooms.astype(int)

In [1]:
-

Please enter prefered price of house: 300000
Please enter max price you will pay: 400000
Please enter prefered number of bedrooms: 4
Please enter max number of bedrooms: 4
Please enter prefered number of bathrooms: 3
Please enter max number of bathrooms: 3
Please enter prefered number of floors: 2
Please enter max number of floors: 2

NameError: name 'csv' is not defined

### pass results into a list

### create function to get ratings

testing git